examples/setup_files/tube/openfoam3d/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-10;
        relTol           1e-5;

        smoother         DICGaussSeidel;

    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          1e-5;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    "cellDisplacement"
    {
    	solver          GAMG;
    	smoother        GaussSeidel;
    	tolerance       1e-10;
    	relTol          0.001;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         3;
    nOuterCorrectors 50;
    residualControl
    {
        U
        {
                tolerance  1e-8;
                relTol      0;
        }
        p
        {
                tolerance  1e-7;
                relTol      0;
        }
     }
}


relaxationFactors
{
 fields
 {
        p               0.7;
 }
 equations
 {
        U               0.7;
        "(k|omega|epsilon).*" 0.7;
 }
}
// ************************************************************************* //
